Chương 6

20110342-Nguyễn Thanh Trúc

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("ex1.csv") # đọc file ex1
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [3]:
pd.read_csv("ex2.csv", header=None) # không có header

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [4]:
pd.read_csv("ex2.csv", names=["a", "b", "c", "d", "message"]) # đặt tên cho header

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
names = ["a", "b", "c", "d", "message"] # tạo list chứa tên header
pd.read_csv("ex2.csv", names=names, index_col="message") # đặt cột message làm index

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [6]:
parsed = pd.read_csv("csv_mindex.csv", index_col=["key1", "key2"]) # đặt cột key1 và key2 làm index
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [7]:
result = pd.read_csv("ex3.txt", sep="\s+") # đọc file txt, dùng \s+ để phân tách các cột
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [8]:
pd.read_csv("ex4.csv", skiprows=[0, 2, 3]) # bỏ qua các dòng 0, 2, 3

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
result = pd.read_csv("ex5.csv") # đọc file ex5
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [10]:
pd.isna(result) # kiểm tra các giá trị NaN

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [11]:
result = pd.read_csv("ex5.csv", na_values=["NULL"]) # đặt giá trị NULL là NaN
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [12]:
result2 = pd.read_csv("ex5.csv", keep_default_na=False) # không đặt giá trị mặc định là NaN
result2

  something  a   b   c   d message
0       one  1   2   3   4      NA
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [13]:
result2.isna() # kiểm tra các giá trị NaN

   something      a      b      c      d  message
0      False  False  False  False  False    False
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [14]:
result3 = pd.read_csv("ex5.csv", keep_default_na=False, na_values=["NA"]) # đặt giá trị NA là NaN
result3

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [15]:
result3.isna() # kiểm tra các giá trị NaN

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [16]:
sentinels = {"message": ["foo", "NA"], "something": ["two"]} # các giá trị NA trong cột message là foo và NA, trong cột something là two
pd.read_csv("ex5.csv", na_values=sentinels, keep_default_na=False)

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       NaN  5   6       8   world
2     three  9  10  11  12     NaN

In [17]:
pd.options.display.max_rows = 10 # hiển thị tối đa 10 dòng

In [18]:
result = pd.read_csv("ex6.csv") # đọc file ex6
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [19]:
pd.read_csv("ex6.csv", nrows=5) # đọc 5 dòng đầu tiên

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [20]:
chunker = pd.read_csv("ex6.csv", chunksize=1000) # đọc file csv, mỗi lần đọc 1000 dòng
type(chunker) # kiểu dữ liệu của chunker

pandas.io.parsers.readers.TextFileReader

In [21]:
chunker = pd.read_csv("ex6.csv", chunksize=1000) # đọc file csv, mỗi lần đọc 1000 dòng

tot = pd.Series([], dtype='int64') # tạo một Series rỗng
for piece in chunker:
    tot = tot.add(piece["key"].value_counts(), fill_value=0) # đếm số lần xuất hiện của các giá trị trong cột key

tot = tot.sort_values(ascending=False) # sắp xếp giảm dần

In [22]:
tot[:10] # hiển thị 10 dòng đầu tiên

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [23]:
data = pd.read_csv("ex5.csv")
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [24]:
data.to_csv("out.csv") # ghi file csv

In [25]:
import sys # thư viện sys
data.to_csv(sys.stdout, sep="|") # ghi file csv, dùng | để phân tách các cột

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [26]:
data.to_csv(sys.stdout, na_rep="NULL") # ghi file csv, đặt giá trị NaN là NULL

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [27]:
data.to_csv(sys.stdout, index=False, header=False) # ghi file csv, không có header và index

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [28]:
data.to_csv(sys.stdout, index=False, columns=["a", "b", "c"]) # ghi file csv, chỉ có các cột a, b, c

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [29]:
import csv
f = open("ex7.csv")
reader = csv.reader(f) # đọc file csv

In [30]:
for line in reader: # đọc từng dòng
    print(line) # hiển thị dòng
f.close()

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [31]:
with open("ex7.csv") as f: # đọc file csv
    lines = list(csv.reader(f)) # đọc từng dòng

In [32]:
header, values = lines[0], lines[1:] # lấy header và các dòng còn lại

In [33]:
data_dict = {h: v for h, v in zip(header, zip(*values))} # tạo dictionary từ header và các dòng còn lại
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [34]:
obj = """
{"name": "Wes",
 "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]},
              {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]
}
""" # chuỗi json

In [35]:
import json
result = json.loads(obj) # đọc chuỗi json
result

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [36]:
asjson = json.dumps(result) # chuyển đổi chuỗi json
asjson

'{"name": "Wes", "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"], "pet": null, "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]}, {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]}'

In [37]:
siblings = pd.DataFrame(result["siblings"], columns=["name", "age"]) # tạo DataFrame từ cột name và cột age
siblings

    name  age
0  Scott   34
1  Katie   42

In [38]:
data = pd.read_json("example.json") # đọc file json
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [39]:
data.to_json(sys.stdout) # ghi file json ra màn hình

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [40]:
data.to_json(sys.stdout, orient="records") # ghi file json ra màn hình, dùng records

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [41]:
tables = pd.read_html("fdic_failed_bank_list.html") # đọc file html
len(tables)

1

In [42]:
failures = tables[0] # lấy dữ liệu từ bảng đầu tiên
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [43]:
close_timestamps = pd.to_datetime(failures["Closing Date"]) # chuyển đổi cột Closing Date sang kiểu datetime
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

In [44]:
frame = pd.read_csv("ex1.csv") 
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [45]:
frame.to_pickle("frame_pickle") # ghi file pickle

In [46]:
pd.read_pickle("frame_pickle") # đọc file pickle

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [48]:
xlsx = pd.ExcelFile("ex1.xlsx") # đọc file excel

In [49]:
xlsx.sheet_names # hiển thị tên các sheet

['Sheet1']

In [50]:
xlsx.parse(sheet_name="Sheet1") # đọc sheet Sheet1

   Unnamed: 0.1  Unnamed: 0  a   b   c   d message
0             0           0  1   2   3   4   hello
1             1           1  5   6   7   8   world
2             2           2  9  10  11  12     foo

In [51]:
xlsx.parse(sheet_name="Sheet1", index_col=0) # đọc sheet Sheet1, cột đầu tiên là index

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [52]:
frame = pd.read_excel("ex1.xlsx", sheet_name="Sheet1") # đọc sheet Sheet1
frame

   Unnamed: 0.1  Unnamed: 0  a   b   c   d message
0             0           0  1   2   3   4   hello
1             1           1  5   6   7   8   world
2             2           2  9  10  11  12     foo

In [53]:
writer = pd.ExcelWriter("ex2.xlsx") # tạo file excel
frame.to_excel(writer, "Sheet1") # ghi sheet Sheet1
writer.save()

In [54]:
frame.to_excel("ex2.xlsx") # ghi file excel

In [55]:
import numpy as np

In [56]:
frame = pd.DataFrame({"a": np.random.standard_normal(100)}) # tạo DataFrame có 100 dòng, cột a là giá trị ngẫu nhiên
store = pd.HDFStore("mydata.h5")  # tạo file hdf5
store["obj1"] = frame # ghi dữ liệu vào file
store["obj1_col"] = frame["a"] # ghi cột a vào file
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [57]:
store["obj1"] # đọc dữ liệu từ file

           a
0   1.743850
1  -1.340563
2   0.363328
3   1.861675
4   0.287734
..       ...
95 -0.728359
96 -1.892703
97 -0.974578
98 -2.335903
99  0.347675

[100 rows x 1 columns]

In [58]:
store.put("obj2", frame, format="table") # ghi dữ liệu vào file, dùng format table
store.select("obj2", where=["index >= 10 and index <= 15"]) # đọc dữ liệu từ file, lấy dòng từ 10 đến 15
store.close() # đóng file

In [59]:
frame.to_hdf("mydata.h5", "obj3", format="table") # ghi dữ liệu vào file, dùng format table
pd.read_hdf("mydata.h5", "obj3", where=["index < 5"]) # đọc dữ liệu từ file, lấy dòng từ 0 đến 5

          a
0  1.743850
1 -1.340563
2  0.363328
3  1.861675
4  0.287734

In [60]:
import os
os.remove("mydata.h5") # xóa file

In [61]:
import requests
url = "https://api.github.com/repos/pandas-dev/pandas/issues" # đường dẫn api
resp = requests.get(url) # gửi yêu cầu lấy dữ liệu
resp.raise_for_status() # kiểm tra trạng thái
resp

In [62]:
data = resp.json() # lấy dữ liệu
data[0]["title"] # lấy tiêu đề của issue đầu tiên

'BUG: pickling subset of Arrow-backed data would serialize the entire data'

In [63]:
issues = pd.DataFrame(data, columns=["number", "title","labels", "state"]) # tạo DataFrame từ dữ liệu, tên cột là number, title, labels, state
issues

,number,title,labels,state
0,49078,BUG: pickling subset of Arrow-backed data woul...,"[{'id': 1625435109, 'node_id': 'MDU6TGFiZWwxNj...",open
1,49077,Backport PR #49072 on branch 1.5.x (BUG: redir...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
2,49076,API: Timestamp and Timedelta .value changing i...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
3,49075,BUG: `USFederalHolidayCalendar.holidays` incon...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
4,49073,BUG: `DatetimeProperties` results seem to be i...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
...,...,...,...,...
25,49037,"API: Series(mixed_datetime_and_ints, dtype=""M8...","[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
26,49034,API: Timestamp(pydatetime) microsecond reso,"[{'id': 3713792788, 'node_id': 'LA_kwDOAA0YD87...",open
27,49032,REG: fix regression in df.corrwith on tied dat...,"[{'id': 32815646, 'node_id': 'MDU6TGFiZWwzMjgx...",open
28,49031,STYLE: suppress false positive pylint findings...,"[{'id': 106935113, 'node_id': 'MDU6TGFiZWwxMDY...",open
29,49029,CI: Investigate slow macOS build time for Pyth...,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open

In [ ]:
import sqlite3

query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""  # tạo câu lệnh tạo bảng

con = sqlite3.connect("mydata.sqlite")  # tạo file sqlite
con.execute(query)  # thực thi câu lệnh tạo bảng
con.commit() # lưu thay đổi

In [ ]:
data = [("Atlanta", "Georgia", 1.25, 6),
        ("Tallahassee", "Florida", 2.6, 3),
        ("Sacramento", "California", 1.7, 5)] # dữ liệu
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)" # câu lệnh thêm dữ liệu

con.executemany(stmt, data) # thực thi câu lệnh thêm dữ liệu
con.commit() # lưu thay đổi

In [ ]:
cursor = con.execute("SELECT * FROM test") # thực thi câu lệnh lấy dữ liệu
rows = cursor.fetchall() # lấy dữ liệu
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [ ]:
cursor.description # lấy thông tin cột
pd.DataFrame(rows, columns=[x[0] for x in cursor.description]) # tạo DataFrame từ dữ liệu

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [ ]:
import sqlalchemy as sqla
db = sqla.create_engine("sqlite:///mydata.sqlite") # tạo kết nối đến file sqlite
pd.read_sql("SELECT * FROM test", db) # đọc dữ liệu từ file sqlite

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5